1.标记：（标签、元素、盒子）

2.块级元素、行内元素、行内块元素


块级元素：
   
   特点：

         1、总是在新一行上开始【独占一行】
         2、高度和行高以及内外边据都是可控制的
         3、宽度缺省默认就是100%宽度

   功能：主要是用来搭建网站架构，页面布局，承载内容

   div : 架构、结构

   p   : 段落

   h1、h2、h3、h4、h5、h6：标题 

   列表：

        ol：有序列表  配合li去使用
        ul：无序列表  配合li去使用


*****规范：在特定的情况下用特定的标记*****











   按功能类别排列 HTML 标签

基础

标签					描述

<!DOCTYPE> 		定义文档类型。
<html>			定义 HTML 文档的根。
<head>			定义关于文档的信息。
<title>			定义文档的标题。
<body>			定义文档的主体。
<h1> to <h6>	定义 HTML 标题。
<p>				定义段落。
<br>			定义简单的折行。
<hr>			定义内容的主题变化。
<!--...-->		定义注释。

格式化

标签					描述
<acronym>		HTML5 中不支持。请使用 <abbr> 代替。定义首字母缩略词。
<abbr>			定义缩写词或首字母缩略词。
<address>		定义文档作者或拥有者的联系信息。
<b>				定义粗体文本。
<bdi>			定义文本的文本方向，使其脱离其周围文本的方向设置。
<bdo>			定义文字方向。
<big>			HTML5 中不支持。请使用 CSS 代替。定义大号文本。
<blockquote>	定义长的引用。
<center>		HTML5 中不支持。请使用 CSS 代替。定义居中的文本。
<cite>			定义作品的标题。
<code>			定义一段计算机代码。
<del>			定义已从文档中删除的文本。
<dfn>			规定要在内容中定义的术语。
<em>			定义强调文本。
<font>			HTML5 中不支持。请使用 CSS 代替。定义文字的字体、尺寸和颜色。
<i>				定义以不同的语气或情态表达的文本部分。
<ins>			定义已插入到文档中的文本。
<kbd>			定义键盘输入。
<mark>			定义应标记或突出显示的文本。
<meter>			定义已知范围内的仪表。
<pre>			定义预格式文本。
<progress>		定义任务进度。
<q>				定义短的引用。
<rp>			定义在不支持 ruby 注释的浏览器中显示的内容。
<rt>			定义字符的解释/发音（针对东亚印刷术）。
<ruby>			定义 ruby 注释（针对东亚印刷术）。
<s>				定义不再正确的文本。
<samp>			定义计算机程序的样本输出。
<small>			定义小号文本。
<strike>		HTML5 中不支持。请使用 <del> 或 <s> 代替。定义加删除线文本。
<strong>		定义重要的文本。
<sup>			定义上标文本。
<sub>			定义下标文本。
<template>		定义用作容纳页面加载时隐藏内容的容器。
<time>			定义日期/时间。
<tt>			HTML5 中不支持。请使用 CSS 代替。定义打字机文本。
<u>				定义未明确表达且样式与普通文本不同的文本。
<var>			定义变量。
<wbr>			定义可能的换行符。

表单和输入

标签					描述
<form>			定义供用户输入的 HTML 表单。
<input>			定义输入控件。
<textarea>		定义多行的文本输入控件。
<button>		定义可点击的按钮。
<select>		定义下拉列表。
<optgroup>		定义下拉列表列表中相关选项的分组。
<option>		定义下拉列表中的选项。
<label>			定义 input 元素 的标注。
<fieldset>		对表单中的相关元素进行分组。
<legend>		定义 fieldset 元素 的标题。
<datalist>		规定输入控件的预定义选项列表。
<output>		定义计算的结果。

框架

标签					描述
<frame>			HTML5 中不支持。定义框架集的窗口或框架。
<frameset>		HTML5 中不支持。定义框架集。
<noframes>		HTML5 中不支持。定义针对不支持框架的用户的替代内容。
<iframe>		定义内联框架。

图像

标签					描述
<img>			定义图像。
<map>			定义图像映射。
<area>			定义图像地图内部的区域。
<canvas>		用于通过脚本（通常是 JavaScript）动态绘制图形。
<figcaption>	定义 figure 元素 的标题。
<figure>		规定自包含的内容。
<picture>		定义多个图像资源的容器。
<svg>			定义 SVG 图形的容器。

音频/视频

标签					描述
<audio>			定义嵌入的声音内容。
<source>		定义媒体元素（如 <video>、<audio> 和 <picture>）的多个媒体资源。
<track>			定义用在媒体播放器中的文本轨道。
<video>			定义嵌入的视频内容。

链接

标签					描述
<a>				定义超链接。
<link>			定义文档与外部资源的关系（最常用于链接样式表）。
<nav>			定义导航链接。

列表

标签					描述
<menu>			定义无序列表。
<ul>			定义无序列表。
<ol>			定义有序列表。
<li>			定义列表的项目。
<dir>			HTML5 中不支持。请使用 CSS 代替。定义目录列表。
<dl>			定义描述列表。
<dt>			定义描述列表中的术语/名称。
<dd>			定义描述列表中术语的描述/值。

表格

标签					描述
<table>			定义表格
<caption>		定义表格标题。
<th>			定义表格中的表头单元格。
<tr>			定义表格中的行。
<td>			定义表格中的单元。
<thead>			定义表格中的表头内容。
<tbody>			定义表格中的主体内容。
<tfoot>			定义表格中的表注内容（脚注）。
<col>			规定 <colgroup> 元素 中每列的列属性。
<colgroup>		规定表格中供格式化的列组。

样式和语义

标签					描述
<style>			定义文档的样式信息。
<div>			定义文档中的节（片段）。
<span>			定义文本的一部分，或文档的一部分。
<header>		定义文档或小节的页眉。
<hgroup>		定义标题和相关内容。
<footer>		定义文档或小节的页脚。
<main>			定义文档的主要内容。
<section>		定义文档中的一个部分。
<search>		定义搜索部分。
<article>		定义文章。
<aside>			定义页面内容之外的内容。
<details>		定义用户可查看或隐藏的其他详细信息。
<dialog>		定义对话框或窗口。
<summary>		定义 <details> 元素的可见标题。
<data>			添加给定内容的机器可读的翻译。

元信息

标签					描述
<head>			包含文档的元数据/信息。
<meta>			定义关于 HTML 文档的元数据。
<base>			规定文档中所有相对 URL 的基准 URL 和/或目标。
<basefont>		HTML5 中不支持。请使用 CSS 代替。定义文档中文本的默认字体、颜色或尺寸。

编程

标签					描述
<script>		定义客户端脚本。
<noscript>		定义针对不支持客户端脚本的用户的替代内容。
<applet>		HTML5 中不支持。请使用 <embed> 和 <object> 代替。定义嵌入式小程序。
<embed>			定义外部资源的容器。
<object>		定义外部资源的容器。
<param>			定义对象的参数。